app/controllers/comments_controller.rb

  def create
        @comment = Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)
---
INSERT INTO `comments` (`text`, `tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES ('きれいですね', 22, 2, '2018-01-02 09:59:46', '2018-01-02 09:59:46')