app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2)
---
    def index
      @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('Apple信者', 'https://scontent-nrt1-1.xx.fbcdn.net/v/t1.0-9/24231787_1344891622304730_5027093299046718303_n.jpg?oh=0d1801103ab4587561199bee20be5b08&oe=5AF2645B', 'ホイアン', 2, '2018-01-02 03:10:45', '2018-01-02 03:10:45')
---
    def create
      Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 5
---
    def destroy
      tweet = Tweet.find(params[:id])
      tweet.destroy if tweet.user_id == current_user.id

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 22 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 22
---
    def show
      @tweet = Tweet.find(params[:id])
      @comments = @tweet.comments.includes(:user)